rnd-image/app/controllers/assets_controller.rb

SELECT * FROM `assets`
---
  def index
    @assets = Asset.all

SELECT * FROM `assets` WHERE (`assets`.`id` = 1)
---
  def show
    @asset = Asset.find(params[:id])

INSERT INTO `assets` (`image_file_name`, `image_file_size`, `image_content_type`, `image_created_at`, `image_updated_at`) VALUES('95345836_050cdb12ee_b.jpg', 514652, 'image/jpeg', NULL, '2009-10-19 14:47:03')
---
  def create
    @asset = Asset.new(params[:asset])

    respond_to do |format|
      if @asset.save